##  Count Salary Categories Leetcode Task18

In [2]:
import pandas as pd
import numpy as np

In [36]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
Accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

In [19]:
Accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [43]:
low_salary_subset = Accounts[Accounts['income'] < 20000]
average_salary_subset = Accounts[Accounts['income'].between(20000, 50000)]
High_Salary_subset=Accounts[Accounts['income'] > 50000]
Low_Salary = 0 if low_salary_subset.empty else len(low_salary_subset)
Average_Salary = 0 if average_salary_subset.empty else len(average_salary_subset)
High_Salary = 0 if High_Salary_subset.empty else len(High_Salary_subset)

In [46]:
pd.DataFrame({'category':['Low Salary','Average Salary','High Salary'],
              'accounts_count':[Low_Salary,Average_Salary,High_Salary]
})

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3